---
kind: method
id: M:Autodesk.Revit.DB.FilteredWorksetCollector.Dispose
source: html/b5065235-5eca-66fc-6648-69556b2b58ca.htm
---
# Autodesk.Revit.DB.FilteredWorksetCollector.Dispose Method

Releases all resources used by the FilteredWorksetCollector

## Syntax (C#)
```csharp
public void Dispose()
```